{"data":{"site":{"siteMetadata":{"title":"Wasuwat Limsuparhat's personal blog","description":"This is Wasuwat Limsuparhat's personal blog. Wasuwat is a software developer based in Bangkok, Thailand. He is a frontend developer and he likes building a blazingly fast and beautiful websites.","author":"Wasuwat Limsuparhat","siteUrl":"https://wasuwat.me"}},"markdownRemark":{"html":"<p><span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block; margin-left: auto; margin-right: auto; margin-left:0!important;margin-right:0!important; max-width: 800px;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 66.66666666666666%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAANABQDASIAAhEBAxEB/8QAFwAAAwEAAAAAAAAAAAAAAAAAAAQFAv/EABQBAQAAAAAAAAAAAAAAAAAAAAD/2gAMAwEAAhADEAAAAYVSdkbEg//EABkQAAMBAQEAAAAAAAAAAAAAAAABAhEDEv/aAAgBAQABBQKE6qlA+CFXgVPdZ//EABQRAQAAAAAAAAAAAAAAAAAAABD/2gAIAQMBAT8BP//EABQRAQAAAAAAAAAAAAAAAAAAABD/2gAIAQIBAT8BP//EABwQAAICAgMAAAAAAAAAAAAAAAABETECIRIygf/aAAgBAQAGPwJLGzjLejvHhqySz//EABwQAQACAgMBAAAAAAAAAAAAAAEAMREhQVFhkf/aAAgBAQABPyEaMqohGYw1MunhUuDbmCdl7no+z//aAAwDAQACAAMAAAAQgw//xAAUEQEAAAAAAAAAAAAAAAAAAAAQ/9oACAEDAQE/ED//xAAUEQEAAAAAAAAAAAAAAAAAAAAQ/9oACAECAQE/ED//xAAbEAEAAgIDAAAAAAAAAAAAAAABABExUSFx8f/aAAgBAQABPxCwI6G4WZYtwBo3ACiINkkcU0MnB1LcgkY9lP/Z'); background-size: cover; display: block;\"\n    ></span>\n    <picture>\n        <source\n          srcset=\"/blog/static/1ac2a6d1ab97971b6a0bfe86b700b7fe/91344/daniele-levis-pelusi-217494-unsplash.webp 200w,\n/blog/static/1ac2a6d1ab97971b6a0bfe86b700b7fe/62d22/daniele-levis-pelusi-217494-unsplash.webp 400w,\n/blog/static/1ac2a6d1ab97971b6a0bfe86b700b7fe/ce1b5/daniele-levis-pelusi-217494-unsplash.webp 800w,\n/blog/static/1ac2a6d1ab97971b6a0bfe86b700b7fe/46103/daniele-levis-pelusi-217494-unsplash.webp 1200w\"\n          sizes=\"(max-width: 800px) 100vw, 800px\"\n          type=\"image/webp\"\n        />\n        <source\n          srcset=\"/blog/static/1ac2a6d1ab97971b6a0bfe86b700b7fe/0502f/daniele-levis-pelusi-217494-unsplash.jpg 200w,\n/blog/static/1ac2a6d1ab97971b6a0bfe86b700b7fe/568be/daniele-levis-pelusi-217494-unsplash.jpg 400w,\n/blog/static/1ac2a6d1ab97971b6a0bfe86b700b7fe/3419f/daniele-levis-pelusi-217494-unsplash.jpg 800w,\n/blog/static/1ac2a6d1ab97971b6a0bfe86b700b7fe/83bd7/daniele-levis-pelusi-217494-unsplash.jpg 1200w\"\n          sizes=\"(max-width: 800px) 100vw, 800px\"\n          type=\"image/jpeg\"\n        />\n        <img\n          class=\"gatsby-resp-image-image\"\n          style=\"width:100%;height:100%;margin:0;vertical-align:middle;position:absolute;top:0;left:0;box-shadow:inset 0px 0px 0px 400px white;\"\n          src=\"/blog/static/1ac2a6d1ab97971b6a0bfe86b700b7fe/3419f/daniele-levis-pelusi-217494-unsplash.jpg\"\n          alt=\"Smokes\"\n          title=\"\"\n        />\n      </picture>\n  </span></p>\n<p>I started smoking since the age of 16. I thought it was cool and relaxing. It was the time that you get to chat with all your friends, telling jokes, listen to each other's problems. I had convinced myself that it helps me concentrate and focus more. So yeah, I did smoke a lot during the time of exams and it somewhat helped. I could remember the picture of every page of the Physics book.</p>\n<p>Although I studied in a boarding school at the times, I always find a way to get cigarettes inside to share among my friends. Sometimes I even smoke local cigarettes that tasted like burning dry grass, but it was manageable as it was so cheap and it stops the craving. The crave was real, trust me.</p>\n<p>I play football regularly during my high school years. I did notice a slow decline in my stamina and in my last year of high school, it only takes 20 minutes of football to exhaust my lungs. I couldn't run much.</p>\n<p>During college, football was once in a while thing. Party was regularly. Most of the time drinking, smoking was like a perfect match. Yeah, I did enjoy both and they kill you. I drink like there was no tomorrow. Chiang Rai offered me peace, nice weathered, cheap beers. What else do you need?</p>\n<p>I noticed that during exam time, it was a different version of me. I was not able to remember things as good as before. I forget things more often. I assumed it was the alcohol and I blame myself for it.</p>\n<p>The life-changing pivot was when I first started working 6 months ago. Work was a lot of fun. I love what I do a lot. I still smoke every break I get. One day, there was a heavy smog consist of very tiny dust particle that your body cannot naturally filter it out. I, who was already allergic to dust was heavily affected. I got sick so bad that I thought I was going to die. My body temperature was over 39.5 degrees, it was burning.</p>\n<p>Subsequently, I got sick very often while working in Bangkok.</p>\n<p>It was the office syndrome. I have no choice as the part of my job is to solve problems using my coding skills and that, I have to sit in front of a computer.</p>\n<p>I started to exercise regularly and set a quit smoking goal like I did many times before which all ended up failed. Instead of smoking every break I get, I code. I even code during my free time. I love it. This time was a success.</p>\n<p>I don't smoke anymore. Not even while drinking. Not even when I need concentration. Not even when my friends are smoking. I have become a person that hated the smoke and I always try to stay away from smokers. Strange thing is that, I did not miss smoking at all. I've successfully convince myself not to use cigarettes as the solution to every problem. There was always better solutions. I was very proud.</p>\n<p>However, one may have different solutions and strategies in quitting. For me, it's just a matter your willingness. If you have a strong will and stay focus, you can achieve anything in life.</p>","excerpt":"I started smoking since the age of 16. I thought it was cool and relaxing. It was the time that you get to chat with all your friends, telling jokes, listen to each other's problems. I had convinced myself that it helps me concentrate and focus more. So yeah, I did smoke a lot during the time of…","frontmatter":{"title":"Best achievement of 2018 - I quit smoking","description":"Story of why I start and I quit smoking after years of wasting money and destroying my own health.","date":"24 December, 2018","thumbnail":{"childImageSharp":{"resize":{"src":"/blog/static/1ac2a6d1ab97971b6a0bfe86b700b7fe/d14c4/daniele-levis-pelusi-217494-unsplash.jpg"}}}}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/quit-smoking/","previous":{"fields":{"slug":"/first-ever-1-000-github-contributions/"},"frontmatter":{"title":"My first ever 1,000 GitHub contributions"}},"next":{"fields":{"slug":"/the-job-interview/"},"frontmatter":{"title":"Why you should go to an interview every once in a while"}}}}